Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation.MessagesFolder Property
 Gets a list Paths to Tekla Structures messages directories.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static SortedSet<string> MessagesFolder { get; }
Public Shared ReadOnly Property MessagesFolder As SortedSet(Of String)
	Get
Property Value
Type: SortedSet<String>
See Also
Reference
StructuresInstallation Class
Tekla.Structures.Dialog Namespace